# PDF_SetPageImage

## Description
Creates image of the passed PDF page object and attaches it into it's child

```pascal
FUNCTION PDF_SetPageImage(inBlobPtr : HANDLE) : BOOLEAN;
```

```python

def vs.PDF_SetPageImage(inBlobPtr):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inBlobPtr|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* PDF